Repository: dd-ix/presence
Catalog: src/locales/*.xlf
Languages: de

source: News
de: Neuigkeiten

source: Documents
de: Dokumente

source: Contact
de: Kontakt

source: Privacy Policy
de: Datenschutzerklärung

source: Imprint
de: Impressum

source: Work in progress
de: In Arbeit

source: Not Found
de: Nicht gefunden

source: How about jumping back to the <a routerLink="/">home</a> page?
de: Wollen Sie zur <a routerLink="/">Startseite</a> zurückspringen?

source: Association
de: Verein

source: Quick Links
de: Lesezeichen

source: Services
de: Dienstleistungen

source: Sponsors
de: Sponsoren

source: Internet Exchange
de: Internet-Knoten

source: Support
de: Unterstützung

source: Accompany us in the development of the DD-IX - the catalyst for the digital future in the region, whether as a sponsor or by joining the association!
de: Ob als Sponsor oder durch Eintritt in den Verein, begleite uns bei der Entwicklung des DD-IX – dem Katalysator für die digitale Zukunft in der Region!

source: What is peering?
de: Was ist Peering?

source: Your benefits of peering using DD-IX as an Internet Exchange Point:
de: Ihre Vorteile des Peering über den DD-IX als Internet Exchange Point:

source: An IXP offers the improved performance already mentioned, since the data exchange between peering partners is exchanged directly. This reduces latency and transmission speeds can be improved.
de: Ein IXP bietet die schon angesprochene verbesserte Leistung, da der Datenaustausch zwischen Peering-Partnern direkt ausgetauscht wird. So wird die Latenz reduziert, und die Übertragungsgeschwindigkeiten können verbessert werden.

source: It also enables better resilience, as traffic can be transmitted even if a connection to a particular network is down, as long as there are alternative peering partners.
de: Zudem ermöglicht es eine bessere Ausfallsicherheit, da der Datenverkehr auch dann übermittelt werden kann, wenn eine Verbindung zu einem bestimmten Netzwerk unterbrochen ist, solange es alternative Peering-Partner gibt.

source: Peering through an IXP (Internet Exchange Point) such as the DD-IX reduces the need for expensive Internet transit services because traffic can be routed directly through the IXP.
de: Das Peering über einen IXP (Internet Exchange Point) wie den DD-IX reduziert den Bedarf an teuren Internettransitdiensten, da der Datenverkehr direkt über den IXP geleitet werden kann.

source: In addition, peering increases network reach and allows access to content and services hosted by other networks and ISPs.
de: Außerdem erhöht Peering die Reichweite der Netzwerke und ermöglicht den Zugriff auf Inhalte und Dienste, die von anderen Netzwerken und ISPs gehostet werden.

source: Locations
de: Standorte

source: The DD-IX is an internet exchange for Dresden and whole Saxony. As a non-commercial platform we are open to all organizations and providers for the multilateral exchange of Internet traffic. Only 20 km from the geographic center of Saxony, the DD-IX locations in Dresden offer the ideal prerequisites to peer with participants in the region.
de: Der DD-IX ist der Internet-Knoten für Dresden und ganz Sachsen. Als nicht-kommerzielle Plattform stehen wir allen Organisationen und Providern zum multilateralen Austausch von Internet-Verkehr offen. Nur 20 km vom geografischen Mittelpunkt Sachsens entfernt, bieten die DD-IX Standorte in Dresden die ideale Voraussetzung, um sich mit den Teilnehmern in der Region zu vernetzen.

source: The IXP is operated by passionately committed people within the DD-IX e.V. i.G. The DD-IX e.V. i.G. will be a registered association under German law. Our mission is to create a basis for the direct exchange of internet traffic within the region. The Internet is based on decentralized networking between providers which is efficiently enabled by IXPs. In addition to increasing the resilience of the Internet, they enable network traffic to take place in a economically and ecologically optimal way.
de: Betrieben wird der IXP von leidenschaftlich Engagierten im Rahmen des DD-IX e.V. i.G. Unsere Mission ist es, eine Basis für den direkten Austausch des Internet-Verkehrs zwischen Quelle und Ziel zu schaffen. Das Internet lebt von einer dezentralen Vermaschung zwischen den Providern, die vor allem durch IXPs effizient ermöglicht wird. Neben der Erhöhung der Widerstandsfähigkeit des Internets findet durch sie der Netzwerkverkehr auf dem ökonomisch und ökologisch optimalen Weg statt.

source: Peering is a term from network technology. It provides for an association of ISPs (Internet Service Providers) or networks to enable data exchange between them. This data transfer between peering partners is free of charge and offers numerous advantages.
de: Peering ist ein Begriff aus der Netzwerktechnologie. Es sorgt für einen Zusammenschluss von ISPs (Internet Service Provider) oder Netzwerken um den Datenaustausch zwischen ihnen zu ermöglichen. Dieser Datentransfer zwischen Peering-Partnern gestaltet sich so kostenfrei und bietet zahlreiche Vorteile.

source: Why should I peer?
de: Warum sollte ich peeren?

source: The goal of peering is to route traffic between participating networks more efficiently and avoid bottlenecks. Direct peering connections provided by the DD-IX allow network packets to take shorter and faster routes. This leads to improved network performance, which can result in a reduction in latency. Optimal routing of network packets is an important aspect of building a robust and efficient Internet, as it forms the basis for exchanging traffic between different regions and countries. Peering enables access to content and services hosted by other networks or ISPs without having to route all traffic over the public Internet.
de: Das Ziel des Peering ist, den Verkehr zwischen beteiligten Netzwerken effizienter zu leiten und Engpässe zu vermeiden. Durch direkte Peering-Verbindungen, die durch den DD-IX bereitgestellt werden, können Netzwerkpakete kürzere und schnellere Routen nehmen. Dies führt zu einer verbesserten Netzwerkleistung, was in einer Verringerung von Latenzzeiten resultieren kann. Ein optimales Leiten der Netzwerkpakete ist ein wichtiger Aspekt beim Aufbau eines robusten und effizienten Internets, da es die Grundlage für den Austausch von Datenverkehr zwischen verschiedenen Regionen und Ländern bildet. Mithilfe des Peering wird der Zugriff auf Inhalte und Dienste, die von anderen Netzwerken oder ISPs gehostet werden, ermöglicht, ohne dass der gesamte Datenverkehr über das öffentliche Internet geroutet werden muss.

source: Peering is a term from network technology. It enables ISPs (Internet Service Providers) or network operators to easily exchange data with each other. This data transfer between peering partners is free of charge and offers numerous advantages.
de: Peering ist ein Begriff aus der Netztechnik. Es ermöglicht ISPs (Internet Service Providers) oder Netzbetreibern einen einfachen Datenaustausch untereinander. Dieser Datentransfer zwischen Peering-Partnern ist kostenlos und bietet zahlreiche Vorteile.

source: An IXP also enables better resilience, as traffic can be transmitted even if a link to a particular network fails, as long as there are routes through alternative peering partners.
de: Ein IXP ermöglicht auch eine bessere Ausfallsicherheit, da der Datenverkehr auch dann übertragen werden kann, wenn eine Verbindung zu einem bestimmten Netz ausfällt, solange es Routen über alternative Peering-Partner gibt.

source: The DD-IX is an internet exchange for Dresden and whole Saxony. As a non-commercial platform, we are open to all organizations and providers for the multilateral exchange of Internet traffic. Only 20 km from the geographic center of Saxony, the DD-IX locations in Dresden offer the ideal prerequisites to peer with participants in the region.
de: Der DD-IX ist der Internet-Knoten für Dresden und ganz Sachsen. Als nicht-kommerzielle Plattform stehen wir allen Organisationen und Providern zum multilateralen Austausch von Internet-Verkehr offen. Nur 20 km vom geografischen Mittelpunkt Sachsens entfernt, bieten die DD-IX Standorte in Dresden die ideale Voraussetzung, um sich mit den Teilnehmern in der Region zu vernetzen.

source: The IXP is operated by passionately committed people within the DD-IX e.V. i.G. The DD-IX e.V. i.G. will be a registered association under German law. Our mission is to create a basis for the direct exchange of internet traffic within the region. The Internet is based on decentralized networking between providers, which is efficiently enabled by IXPs. In addition to increasing the resilience of the Internet, they enable network traffic to take place in an economically and ecologically optimal way.
de: Betrieben wird der IXP von leidenschaftlich Engagierten im Rahmen des DD-IX e.V. i.G. Unsere Mission ist es, eine Basis für den direkten Austausch des Internet-Verkehrs zwischen Quelle und Ziel zu schaffen. Das Internet lebt von einer dezentralen Vermaschung zwischen den Providern, die vor allem durch IXPs effizient ermöglicht wird. Neben der Erhöhung der Widerstandsfähigkeit des Internets findet durch sie der Netzwerkverkehr auf dem ökonomisch und ökologisch optimalen Weg statt.

source: Peering through an IXP like the DD-IX reduces the need for expensive Internet transit services. Because only the connection are paid for and not the data volume used.
de: Das Peering über einen IXP wie den DD-IX reduziert den Bedarf an teuren Internet-Transitdiensten. Denn es wird nur die Verbindung bezahlt und nicht das genutzte Datenvolumen.

source: The aim of peering is to route traffic between the participating networks more efficiently and to avoid bottlenecks. Through peering connections provided by DD-IX, we enable all participants to route network packets among each other shorter and faster.
de: Ziel des Peering ist es, den Verkehr zwischen den beteiligten Netzen effizienter zu leiten und Engpässe zu vermeiden. Durch die von DD-IX bereitgestellten Peering-Verbindungen ermöglichen wir allen Teilnehmern, Netzwerkpakete untereinander kürzer und schneller zu leiten.

source: Networking and Sharing Experiences
de: Vernetzung und Erfahrungsaustausch

source: Besides the peering LAN and our route servers for the core operation of the IXP, we run most of the systems of the association ourselves.
de: Neben dem Peering LAN und unseren Route Server für den Kernbetrieb des IXP betreiben wir auch die weitere Technik für den Verein zu großen Teilen selbst.

source: Association Work
de: Vereinsarbeit

source: The work in the association is organized in different boards and working groups:
de: Die Arbeit im Verein ist in verschiedenen Gremien und Arbeitskreise organisiert:

source: Technical Operation & Advisory Board
de: Technischer Betrieb

source: Public Relations
de: Öffentlichkeitsarbeit

source: Participation & Joining
de: Mitarbeit & Beitritt

source: Optimal network packet forwarding is an important aspect of building a robust and efficient Internet. Peering with an IXP allows access to content and services provided by other network operators or ISPs without the need to establish many direct peerings among each other.
de: Die optimale Weiterleitung von Netzpaketen ist ein wichtiger Aspekt beim Aufbau eines robusten und effizienten Internets. Peering mit einem IXP ermöglicht den Zugang zu Inhalten und Diensten, die von anderen Netzbetreibern oder Internet-Diensteanbietern bereitgestellt werden, ohne dass viele direkte Peerings untereinander eingerichtet werden müssen.

source: Our Vision
de: Unsere Vision

source: We want to promote Saxony as an attractive IT location with a focus on Dresden. Our main focus is the further expansion of the internet communication network. We committ as non-profit organisation for:
de: Wir wollen die Region Sachsen mit dem Schwerpunkt Dresden als attraktiven IT-Standort weiter voranbringen. Unser Hauptaugenmerk liegt in der Weiterentwicklung des Kommunikationsnetzes Internet. Um dieses Ziel zu erreichen, fokussieren wir uns gemeinnützig auf:

source: We are available as an objective point of contact for organizations, science, business and the public on issues relating to the internet. In addition to the exchange of experiences within the association and with external third parties, we conduct information and training events. Furthermore, we participate in community events.
de: Wir stehen als objektiver Ansprechpartner für Organisationen, Wissenschaft, Wirtschaft und Öffentlichkeit bei Fragen zum Internet zur Verfügung. Neben dem Erfahrungsaustausch im Verein und mit außenstehenden Dritten führen wir Informations- und Schulungsveranstaltungen durch. Des Weiteren nehmen wir an Konferenzen der Community teil.

source: Operation of the DD-IX
de: Betrieb des DD-IX

source: In addition to supporting the community, we run the internet exchange DD-IX at locations in Dresden. DD-IX sees itself as an open, non-profit platform for all internet participants with a AS in the region of Saxony.
de: Neben der Unterstützung der Community betreiben wir den Internet-Exchange DD-IX an Standorten Dresden. Der DD-IX versteht sich als offene, nicht gewinnorientierte Plattform für alle Internetteilnehmer mit einem eigenen AS in der Region Sachsen.

source: The association is made up of committed members who work voluntarily for the achievement of the goals. Even though the association seems to be technical through IXP operations we are also involved in non-technical areas.
de: Das Rückgrat des Vereins sind seine engagierten Mitglieder, die sich ehrenamtlich für das Erreichen der Ziele einsetzen. Auch wenn der Verein durch den IXP-Betrieb scheinbar technisch geprägt ist, engagieren wir uns auch in nicht-technischen Bereichen.

source: Management Board
de: Vorstand

source: Event Management
de: Veranstaltungsmanagement

source: Customer & Sponsorship Acquisition
de: Kunden & Sponsoring Akquise

source: Are you interested in working for the association? We are looking forward to you!
de: Du interessierst dich für die Arbeit im Verein? Wir freuen uns auf dich!

source: You do not have to be a member of the association to participate. But as a full member you have your own voting rights in the corresponding boards of the association. All legal documents of the association are linked at the bottom of this page.
de: Für das Mitwirken im Verein musst du nicht zwingend Vereinsmitglied werden. Als ordentliches Mitglied besitzt du jedoch ein eigenes Stimmrecht in den entsprechenden Gremien des Vereins. Alle verbindlichen Dokumente des Vereins findest du am Ende dieser Seite verlinkt.

source: Subscribe to the {{listName}} mailing list
de: Der {{listName}} Mailingliste beitreten

source: A name is required.
de: Ein Name ist erforderlich.

source: A valid e-mail is required!
de: Eine gültige E-Mail ist erforderlich!

source: Submit
de: Absenden
